nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW235B/MCXW235B_COMMON.h
/* FLASH_NMPA - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral FLASH_NMPA base address */
  #define FLASH_NMPA_BASE                          (0x10108000u)
  /** Peripheral FLASH_NMPA base address */
  #define FLASH_NMPA_BASE_NS                       (0x108000u)
  /** Peripheral FLASH_NMPA base pointer */
  #define FLASH_NMPA                               ((FLASH_NMPA_Type *)FLASH_NMPA_BASE)
  /** Peripheral FLASH_NMPA base pointer */
  #define FLASH_NMPA_NS                            ((FLASH_NMPA_Type *)FLASH_NMPA_BASE_NS)
  /** Array initializer of FLASH_NMPA peripheral base addresses */
  #define FLASH_NMPA_BASE_ADDRS                    { FLASH_NMPA_BASE }
  /** Array initializer of FLASH_NMPA peripheral base pointers */
  #define FLASH_NMPA_BASE_PTRS                     { FLASH_NMPA }
  /** Array initializer of FLASH_NMPA peripheral base addresses */
  #define FLASH_NMPA_BASE_ADDRS_NS                 { FLASH_NMPA_BASE_NS }
  /** Array initializer of FLASH_NMPA peripheral base pointers */
  #define FLASH_NMPA_BASE_PTRS_NS                  { FLASH_NMPA_NS }
#else
  /** Peripheral FLASH_NMPA base address */
  #define FLASH_NMPA_BASE                          (0x108000u)
  /** Peripheral FLASH_NMPA base pointer */
  #define FLASH_NMPA                               ((FLASH_NMPA_Type *)FLASH_NMPA_BASE)
  /** Array initializer of FLASH_NMPA peripheral base addresses */
  #define FLASH_NMPA_BASE_ADDRS                    { FLASH_NMPA_BASE }
  /** Array initializer of FLASH_NMPA peripheral base pointers */
  #define FLASH_NMPA_BASE_PTRS                     { FLASH_NMPA }
#endif

/* FLASH_ROMPATCH - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral FLASH_ROMPATCH base address */
  #define FLASH_ROMPATCH_BASE                      (0x10108000u)
  /** Peripheral FLASH_ROMPATCH base address */
  #define FLASH_ROMPATCH_BASE_NS                   (0x108000u)
  /** Peripheral FLASH_ROMPATCH base pointer */
  #define FLASH_ROMPATCH                           ((FLASH_ROMPATCH_Type *)FLASH_ROMPATCH_BASE)
  /** Peripheral FLASH_ROMPATCH base pointer */
  #define FLASH_ROMPATCH_NS                        ((FLASH_ROMPATCH_Type *)FLASH_ROMPATCH_BASE_NS)
  /** Array initializer of FLASH_ROMPATCH peripheral base addresses */
  #define FLASH_ROMPATCH_BASE_ADDRS                { FLASH_ROMPATCH_BASE }
  /** Array initializer of FLASH_ROMPATCH peripheral base pointers */
  #define FLASH_ROMPATCH_BASE_PTRS                 { FLASH_ROMPATCH }
  /** Array initializer of FLASH_ROMPATCH peripheral base addresses */
  #define FLASH_ROMPATCH_BASE_ADDRS_NS             { FLASH_ROMPATCH_BASE_NS }
  /** Array initializer of FLASH_ROMPATCH peripheral base pointers */
  #define FLASH_ROMPATCH_BASE_PTRS_NS              { FLASH_ROMPATCH_NS }
#else
  /** Peripheral FLASH_ROMPATCH base address */
  #define FLASH_ROMPATCH_BASE                      (0x108000u)
  /** Peripheral FLASH_ROMPATCH base pointer */
  #define FLASH_ROMPATCH                           ((FLASH_ROMPATCH_Type *)FLASH_ROMPATCH_BASE)
  /** Array initializer of FLASH_ROMPATCH peripheral base addresses */
  #define FLASH_ROMPATCH_BASE_ADDRS                { FLASH_ROMPATCH_BASE }
  /** Array initializer of FLASH_ROMPATCH peripheral base pointers */
  #define FLASH_ROMPATCH_BASE_PTRS                 { FLASH_ROMPATCH }
#endif

/* FLEXCOMM - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral FLEXCOMM0 base address */
  #define FLEXCOMM0_BASE                           (0x50086000u)
  /** Peripheral FLEXCOMM0 base address */
  #define FLEXCOMM0_BASE_NS                        (0x40086000u)
  /** Peripheral FLEXCOMM0 base pointer */
  #define FLEXCOMM0                                ((FLEXCOMM_Type *)FLEXCOMM0_BASE)
  /** Peripheral FLEXCOMM0 base pointer */
  #define FLEXCOMM0_NS                             ((FLEXCOMM_Type *)FLEXCOMM0_BASE_NS)
  /** Peripheral FLEXCOMM1 base address */
  #define FLEXCOMM1_BASE                           (0x50087000u)
  /** Peripheral FLEXCOMM1 base address */
  #define FLEXCOMM1_BASE_NS                        (0x40087000u)
  /** Peripheral FLEXCOMM1 base pointer */
  #define FLEXCOMM1                                ((FLEXCOMM_Type *)FLEXCOMM1_BASE)
  /** Peripheral FLEXCOMM1 base pointer */
  #define FLEXCOMM1_NS                             ((FLEXCOMM_Type *)FLEXCOMM1_BASE_NS)
  /** Peripheral FLEXCOMM2 base address */
  #define FLEXCOMM2_BASE                           (0x50088000u)
  /** Peripheral FLEXCOMM2 base address */
  #define FLEXCOMM2_BASE_NS                        (0x40088000u)
  /** Peripheral FLEXCOMM2 base pointer */
  #define FLEXCOMM2                                ((FLEXCOMM_Type *)FLEXCOMM2_BASE)
  /** Peripheral FLEXCOMM2 base pointer */
  #define FLEXCOMM2_NS                             ((FLEXCOMM_Type *)FLEXCOMM2_BASE_NS)
  /** Array initializer of FLEXCOMM peripheral base addresses */
  #define FLEXCOMM_BASE_ADDRS                      { FLEXCOMM0_BASE, FLEXCOMM1_BASE, FLEXCOMM2_BASE }
  /** Array initializer of FLEXCOMM peripheral base pointers */
  #define FLEXCOMM_BASE_PTRS                       { FLEXCOMM0, FLEXCOMM1, FLEXCOMM2 }
  /** Array initializer of FLEXCOMM peripheral base addresses */
  #define FLEXCOMM_BASE_ADDRS_NS                   { FLEXCOMM0_BASE_NS, FLEXCOMM1_BASE_NS, FLEXCOMM2_BASE_NS }
  /** Array initializer of FLEXCOMM peripheral base pointers */
  #define FLEXCOMM_BASE_PTRS_NS                    { FLEXCOMM0_NS, FLEXCOMM1_NS, FLEXCOMM2_NS }
#else
  /** Peripheral FLEXCOMM0 base address */
  #define FLEXCOMM0_BASE                           (0x40086000u)
  /** Peripheral FLEXCOMM0 base pointer */
  #define FLEXCOMM0                                ((FLEXCOMM_Type *)FLEXCOMM0_BASE)
  /** Peripheral FLEXCOMM1 base address */
  #define FLEXCOMM1_BASE                           (0x40087000u)
  /** Peripheral FLEXCOMM1 base pointer */
  #define FLEXCOMM1                                ((FLEXCOMM_Type *)FLEXCOMM1_BASE)
  /** Peripheral FLEXCOMM2 base address */
  #define FLEXCOMM2_BASE                           (0x40088000u)
  /** Peripheral FLEXCOMM2 base pointer */
  #define FLEXCOMM2                                ((FLEXCOMM_Type *)FLEXCOMM2_BASE)
  /** Array initializer of FLEXCOMM peripheral base addresses */
  #define FLEXCOMM_BASE_ADDRS                      { FLEXCOMM0_BASE, FLEXCOMM1_BASE, FLEXCOMM2_BASE }
  /** Array initializer of FLEXCOMM peripheral base pointers */
  #define FLEXCOMM_BASE_PTRS                       { FLEXCOMM0, FLEXCOMM1, FLEXCOMM2 }
#endif
/** Interrupt vectors for the FLEXCOMM peripheral type */
#define FLEXCOMM_IRQS                            { FLEXCOMM0_IRQn, FLEXCOMM1_IRQn, FLEXCOMM2_IRQn }

/* FMU - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral FMU0 base address */
  #define FMU0_BASE                                (0x50034000u)
  /** Peripheral FMU0 base address */
  #define FMU0_BASE_NS                             (0x40034000u)
  /** Peripheral FMU0 base pointer */
  #define FMU0                                     ((FMU_Type *)FMU0_BASE)
  /** Peripheral FMU0 base pointer */
  #define FMU0_NS                                  ((FMU_Type *)FMU0_BASE_NS)
  /** Array initializer of FMU peripheral base addresses */
  #define FMU_BASE_ADDRS                           { FMU0_BASE }
  /** Array initializer of FMU peripheral base pointers */
  #define FMU_BASE_PTRS                            { FMU0 }
  /** Array initializer of FMU peripheral base addresses */
  #define FMU_BASE_ADDRS_NS                        { FMU0_BASE_NS }
  /** Array initializer of FMU peripheral base pointers */
  #define FMU_BASE_PTRS_NS                         { FMU0_NS }
#else
  /** Peripheral FMU0 base address */
  #define FMU0_BASE                                (0x40034000u)
  /** Peripheral FMU0 base pointer */
  #define FMU0                                     ((FMU_Type *)FMU0_BASE)
  /** Array initializer of FMU peripheral base addresses */
  #define FMU_BASE_ADDRS                           { FMU0_BASE }
  /** Array initializer of FMU peripheral base pointers */
  #define FMU_BASE_PTRS                            { FMU0 }
#endif

